// © Copyright 2004-2010, 2015 HP Development Company, L.P.

TaskName = "Opdatering af firmware";

// Errors
FileOpenError = "Kan ikke åbne filen %@.";
FileOpenErrorExplanation = "Filen er enten ødelagt eller er blevet flyttet til et andet sted, omdøbt eller slettet. Kontrollér filens placering, eller vælg en anden fil, og prøv igen.";
PrintChannelOpenError = "Kan ikke åbne en printerkanal.";
PrintChannelOpenErrorExplanation = "Kontrollér, at printeren er tilsluttet og tændt, og prøv derefter igen.";
SendDataError = "Kan ikke sende data til printeren.";
SendDataErrorExplanation = "Kontrollér, at printeren er tilsluttet og tændt, og prøv derefter igen.";

SomePenErrorTitle = "Kan ikke opdatere firmware.";
DoorOpenMsg = "Kan ikke opdatere firmware, da et dæksel er åbent. Luk alle dæksler på printeren.";

// Aquamarine Errors
FileCheckError = "Kan ikke opdatere firmware.";
FileCheckErrorExplanation = "Firmware-pakken er ikke gyldig. Vælg en anden fil, og prøv igen.";

OkButton = "OK";
CancelButton = "Annuller";
FirmwareUpdateTitle = "Opdatering af firmware";
FirmwareUpdateDeviceState = "Udskriver";
FirmwareUpdateCancelingDeviceState = "Annullerer";

// Great Wall Messages
PrinterIdleWarning = "Firmware-opdateringen kan mislykkes, hvis printeren er optaget (f.eks. under udskrivning eller kalibrering).\n\nKontrollér, at printeren er ledig, før der fortsættes med firmware-opdateringen.";
UpdateSuccessful = "Firmware-filen blev overført, og printeren opdateres om et kort øjeblik.\n\nSå snart firmware-opdateringen er fuldført, genstartes printeren automatisk.";
InvalidPackage = "Der opstod problemer med firmware-filen, og firmware-opdateringen blev ikke udført korrekt. Problemet skyldes muligvis en transmissionsfejl.\n\nForsøg at udføre firmware-opdateringen igen.\nHvis dette ikke løser problemet, skal du kontakte HP’s supportafdeling.";
FailedDependencies = "Firmware-opdateringen kunne ikke udføres korrekt som følge af et afhængighedsproblem.\n\nDen aktuelle firmware-version er %@, og du forsøger at installere %@.\n\nGå ind på følgende webside for at finde den korrekte opdateringspakke til denne printer:\n%@.";
NotNow = "Firmware-opdateringen blev ikke udført korrekt, fordi printeren er optaget (er f.eks. i gang med at behandle eller udskrive et job).\n\nKontrollér, at printeren er ledig, og udfør firmware-opdateringen igen.";
TransmissionError = "Der opstod problemer med transmissionen, som betød, at firmware-opdateringen ikke blev udført korrekt.\n\nKontrollér forbindelsen til printeren, og udfør firmware-opdateringen igen.";
LicenseNotAccepted = "Firmware-opdateringen blev ikke udført, fordi licensen ikke blev accepteret.";
FatalError = "Der opstod problemer, som forhindrede korrekt udførelse af firmware-opdateringen.\n\nHvis problemet opstår igen, kontaktes HP’s supportafdeling.";

// layout
TaskTitle = "Opdatering af firmware";
TaskDescription = "Vælg en fil, som indeholder en firmware-opdatering, og overfør den pågældende fil til printeren med henblik på opdatering.";
FileNameTitle = "Filnavn:";
FileNameField = "<Ikke valgt>";
ChooseButton = "Vælg…";
UpdateButton = "Opdater";
ProgressPanel = "Opdateringsstatus";
FirmwareUpdateProcessTitle = "Opdaterer…";
